Repository: NMarjou/localization-app
Catalog: TMs/en-US_de-DE.tmx
Source language: en_us
Languages: de_de

source: New manager
de_de: Neue Führungskraft

source: Search for a manager
de_de: Nach einer Führungskraft suchen

source: The new manager cannot be empty.
de_de: Der neue Manager darf nicht leer sein.

source: Reassign
de_de: Neu zuweisen

source: Reassign manager
de_de: Manager neu zuweisen

source: This team member has no check-ins yet. Help start their journey by creating their first check-in.
de_de: Dieses Teammitglied hat noch keine Check-ins. Helfen Sie, ihre Reise zu beginnen, indem Sie den ersten Check-in erstellen.

source: This team member has no goals yet. Create goals to help them progress.
de_de: Dieses Teammitglied hat noch keine Ziele. Erstellen Sie Ziele, um ihm bei der Weiterentwicklung zu helfen.

source: Enhance this team member's profile by adding & rating skills
de_de: Erweitern Sie das Profil dieses Teammitglieds, indem Sie Fähigkeiten hinzufügen und bewerten

source: Attached files
de_de: Angehängte Dateien

source: Upload supporting files for the career development.
de_de: Laden Sie unterstützende Dateien für die berufliche Entwicklung hoch.

source: Preview goals in the career development page.
de_de: Vorschau auf Ziele auf der Seite zur Karriereentwicklung.

source: You don’t have the necessary permissions to manage goal plans.
de_de: Sie haben nicht die erforderlichen Berechtigungen, um Zielpläne zu verwalten.

source: Please contact your system administrator for assistance.
de_de: Bitte wenden Sie sich an Ihren Systemadministrator, um Unterstützung zu erhalten.

source: Select goal plan
de_de: Zielplan auswählen

source: Select goal type
de_de: Zieltyp auswählen

source: Go to the career plan questionnaire step to make changes.
de_de: Gehen Sie zum Schritt des Karriereplan-Fragebogens, um Änderungen vorzunehmen.

source: All skills from the library
de_de: Alle Fähigkeiten aus der Bibliothek

source: Define the source for skills and competency scales.
de_de: Definieren Sie die Quelle für Fähigkeiten- und Kompetenzskalen.

source: Select skills & competency groups
de_de: Fähigkeiten & Kompetenzgruppen auswählen

source: Choose one option
de_de: Wählen Sie eine Option

source: Selected skills & competency groups
de_de: Ausgewählte Fähigkeiten & Kompetenzgruppen

source: Select competency scale
de_de: Kompetenzskala auswählen

source: Preview check-ins in the career development page.
de_de: Vorschau der Check-ins auf der Seite zur Karriereentwicklung.

source: You must enable at least one widget to move to the next step.
de_de: Sie müssen mindestens ein Widget aktivieren, um zum nächsten Schritt zu gelangen.

source: Career plans
de_de: Karrierepläne

source: Participants
de_de: Teilnehmer

source: Reflect on your achievements, challenges, and career aspirations. Taking a moment to think about your experiences will help you clearly articulate your development goals.
de_de: Denken Sie über Ihre Erfolge, Herausforderungen und beruflichen Ziele nach. Wenn Sie sich einen Moment Zeit nehmen, um über Ihre Erfahrungen nachzudenken, können Sie Ihre Entwicklungsziele klar formulieren.

source: Identify both your short- and long-term career goals. Be specific about what you want to accomplish and the skills you’d like to develop. This will ensure the plan aligns with your personal and professional growth.
de_de: Identifizieren Sie sowohl Ihre kurz- als auch langfristigen Karriereziele. Seien Sie konkret, was Sie erreichen möchten und welche Fähigkeiten Sie entwickeln möchten. So stellen Sie sicher, dass der Plan mit Ihrem persönlichen und beruflichen Wachstum übereinstimmt.

source: Think about the training, projects, or responsibilities that can help you achieve your goals. In your plan, include opportunities that will support your growth and career advancement.
de_de: Denken Sie an Schulungen, Projekte oder Verantwortlichkeiten, die Ihnen helfen können, Ihre Ziele zu erreichen. Nehmen Sie in Ihren Plan Möglichkeiten auf, die Ihr Wachstum und Ihre berufliche Weiterentwicklung unterstützen.

source: Break your goals down into actionable steps. Be sure to outline a timeline for achieving them and track your progress along the way.
de_de: Teilen Sie Ihre Ziele in umsetzbare Schritte auf. Legen Sie unbedingt einen Zeitplan für deren Erreichung fest und verfolgen Sie Ihren Fortschritt auf dem Weg dorthin.

source: Create a supportive environment where workers feel comfortable sharing their aspirations, challenges, and goals. Listen actively and ask thoughtful questions to better understand their vision.
de_de: Schaffen Sie ein unterstützendes Umfeld, in dem sich Mitarbeiter:innen wohlfühlen, ihre Wünsche, Herausforderungen und Ziele zu teilen. Hören Sie aktiv zu und stellen Sie gezielte Fragen, um ihre Vorstellungen besser zu verstehen.

source: Take time to review the worker's career development plan in detail. Provide constructive feedback, acknowledge their strengths, and highlight areas for growth.
de_de: Nehmen Sie sich Zeit, um den Karriereentwicklungsplan der Mitarbeiter:in im Detail zu beurteilen. Geben Sie konstruktives Feedback, erkennen Sie deren Stärken an und heben Sie Bereiche hervor, in denen Wachstum möglich ist.

source: Encourage your reports to explore new challenges and opportunities that help them grow while building on their current strengths and skills.
de_de: Ermutigen Sie Ihre Mitarbeiter:innen, neue Herausforderungen und Möglichkeiten zu erkunden, die ihnen beim Wachsen helfen und gleichzeitig auf ihren aktuellen Stärken und Fähigkeiten aufbauen.

source: Share your own experiences and insights to inspire and guide workers. Be their advocate and actively support their growth journey.
de_de: Teilen Sie Ihre eigenen Erfahrungen und Erkenntnisse, um Mitarbeiter:innen zu inspirieren und zu begleiten. Setzen Sie sich für sie ein und unterstützen Sie ihre Entwicklung aktiv.

source: Prepare in advance
de_de: Bereiten Sie sich im Voraus vor

source: Define your goals
de_de: Definieren Sie Ihre Ziele

source: Explore development opportunities
de_de: Entwicklungsmöglichkeiten erkunden

source: Set actionable steps
de_de: Setzen Sie umsetzbare Schritte

source: Encourage open dialogue
de_de: Fördern Sie einen offenen Dialog

source: Review the plan thoroughly
de_de: Überprüfen Sie den Plan gründlich

source: Suggest opportunities for growth
de_de: Schlagen Sie Möglichkeiten zur Weiterentwicklung vor

source: Be a mentor, not just a manager
de_de: Seien Sie ein:e Mentor:in, nicht nur eine Führungskraft

source: Here are some tips to guide you through filling out your career development plan:
de_de: Hier sind einige Tipps, die Ihnen beim Ausfüllen Ihres Karriereentwicklungsplans helfen:

source: Foster meaningful career development conversations!
de_de: Führen Sie bedeutungsvolle Gespräche zur beruflichen Entwicklung!

source: Here are tips to effectively guide workers in their career development plans:
de_de: Hier sind Tipps, um Mitarbeiter:innen effektiv bei ihren Karriereentwicklungsplänen zu begleiten:

source: Career plans that your team members own.
de_de: Karrierepläne, die Ihren Teammitgliedern gehören.

source: This worker currently has no career development plans
de_de: Diese:r Mitarbeiter:in hat derzeit keine Karriereentwicklungspläne.

source: Are you sure you want to reassign this career development plan to the selected manager?
de_de: Sind Sie sicher, dass Sie diesen Entwicklungsplan für die berufliche Laufbahn dem ausgewählten Manager neu zuweisen möchten?

source: Confirm reassignment
de_de: Neuzuweisung bestätigen

source: The career development plan was successfully reassigned.
de_de: Der Karriereentwicklungsplan wurde erfolgreich neu zugewiesen.

source: {{count}}/{{limit}} characters
de_de: {{count}}/{{limit}} Zeichen

source: The text exceeds the character limit.
de_de: Der Text überschreitet das Zeichenlimit.

source: Once your manager submits their view on your performance, you will be invited to either accept and complete the check-in, or request to meet for further discussion.
de_de: Sobald Ihre Führungskraft die Sicht auf Ihre Leistung eingereicht hat, werden Sie eingeladen, dies entweder zu akzeptieren und das Check-in abzuschließen oder um ein Treffen für eine weitere Diskussion zu bitten.

source: Set date
de_de: Datum festlegen

source: Add discussion point
de_de: Diskussionspunkt hinzufügen

source: Add recurrence
de_de: Wiederholung hinzufügen

source: If yes, click the button and open the file once it has been downloaded to add this event to your calendar, and that of the other attendee.
de_de: Wenn ja, klicken Sie auf die Schaltfläche und öffnen Sie die Datei, sobald sie heruntergeladen wurde, um dieses Ereignis zu Ihrem Kalender und dem des/der anderen Teilnehmer:in hinzuzufügen.

source: Download invite
de_de: Einladung herunterladen

source: Do you want to add this check-in to your calendar?
de_de: Möchten Sie diesen Check-in zu Ihrem Kalender hinzufügen?

source: Make your check-ins more effective by adding key discussion points and agenda items every week. Reflect on the past week and plan for the next week to help increase productivity and ensure you and your manager are aligned on important deliverables.
de_de: Machen Sie Ihre Check-ins effektiver, indem Sie jede Woche wichtige Diskussionspunkte und Tagesordnungspunkte hinzufügen. Denken Sie über die vergangene Woche nach und planen Sie die nächste Woche, um die Produktivität zu steigern und sicherzustellen, dass Sie und Ihre Führungskraft sich über wichtige Ergebnisse einig sind.

source: Have a great check-in conversation!
de_de: Ein erfolgreicher Dialog

source: Here are some tips to make the most of your check-ins.
de_de: Hier einige Tipps, um das Beste aus deinem Dialog herauszuholen.

source: Make sure you use your check-in time wisely. Coming prepared can greatly benefit the quality of the conversation and also impress your manager, as it demonstrates your focus on your goals and development.
de_de: Stellen Sie sicher, dass Sie Ihre Check-in-Zeit sinnvoll nutzen. Eine gute Vorbereitung kann die Qualität des Gesprächs erheblich verbessern und Ihre Führungskraft beeindrucken, da Sie damit zeigen, dass Sie sich auf Ihre Ziele und Ihre Entwicklung konzentrieren.

source: The central focus of a check-in should be your current workload, and it should aim at ensuring that you and your manager are aligned on your projects and goals.
de_de: Im Mittelpunkt eines Check-ins sollte Ihr aktuelles Arbeitspensum stehen, und es sollte darauf abzielen, dass Sie und Ihre Führungskraft hinsichtlich Ihrer Projekte und Ziele auf einer Linie sind.

source: To prepare for your check-in, take some notes about the main items you have been working on that week and any key points you want to discuss. It only takes five minutes, but it can significantly improve the quality of your conversation.
de_de: Mache dir Notizen zu den wichtigsten Themen, an denen du arbeitest sowie zu den Punkten, die du besprechen möchtest. Es dauert nur ein paar Minuten.

source: All participants
de_de: Alle Teilnehmer:innen

source: Assign check-in
de_de: Check-in zuweisen

source: Recognize behavior profile of:
de_de: Verhaltensprofil erkennen von:

source: Offer your team member insight into how you think they have progressed on their behaviors over this period.
de_de: Bieten Sie Ihrem Teammitglied einen Einblick, wie sich dessen Verhalten in diesem Zeitraum Ihrer Meinung nach entwickelt hat.

source: You have changed the type of the check-in. Please review the change with the check-in attendee.
de_de: Sie haben den Typ des Check-ins geändert. Bitte überprüfen Sie die Änderung mit dem/der Check-in-Teilnehmer:in.

source: No messages yet
de_de: Noch keine Nachrichten

source: Why not start a conversation now?
de_de: Warum nicht jetzt ein Gespräch beginnen?

source: The check-in <u>{{title}} with {{name}}</u> was completed.
de_de: Check-in <u>{{title}} mit {{name}}</u> ist abgeschlossen.

source: Your check-in was successfully created.
de_de: Ihr Check-in wurde erfolgreich erstellt.

source: {{numberOfCheckins}} check-ins with {{AssignedToUserName}} will be created.
de_de: {{numberOfCheckins}} Check-ins mit {{AssignedToUserName}} werden erstellt.

source: You can create another check-in at any time.
de_de: Sie können jederzeit ein weiteres Check-in erstellen.

source: {{count}} check-ins were successfully created.
de_de: {{count}} Check-ins wurden erfolgreich erstellt.

source: The scheduled check-in <u>{{title}} with {{name}}</u> was canceled.
de_de: Geplantes Check-in <u>{{title}} mit {{name}}</u> wurde abgesagt.

source: Your check-in was successfully saved.
de_de: Ihr Check-in wurde erfolgreich gespeichert.

source: Focus factors for this check-in
de_de: Fokusfaktoren für dieses Check-in

source: Your check-in was successfully updated.
de_de: Ihr Check-in wurde erfolgreich aktualisiert.

source: {{name}} will be notified that you have updated this check-in.
de_de: {{name}} wird benachrichtigt, dass Sie dieses Check-in aktualisiert haben.

source: Add point
de_de: Punkt hinzufügen

source: No discussion points for the moment
de_de: Derzeit keine Diskussionspunkte

source: Checklist
de_de: Checkliste

source: Are you sure you want to mark the check-in <strong>{{name}}</strong> as complete?
de_de: Sind Sie sicher, dass Sie das Check-in <strong>{{name}}</strong> als abgeschlossen markieren möchten?

source: Complete check-in
de_de: Check-in abschließen

source: Select a date
de_de: Datum auswählen

source: Are you sure you want to remove the check-in <strong>{{name}}</strong> from your check-in list?
de_de: Sind Sie sicher, dass Sie das Check-in <strong>{{name}}</strong> aus Ihrer Check-in-Liste entfernen möchten?

source: Delete check-in
de_de: Check-in löschen

source: Description and discussion points
de_de: Beschreibung und Diskussionspunkte

source: Check-ins created
de_de: Check-ins erstellt

source: To help you prepare, include an overview of what you'd like to talk about here.
de_de: Geben Sie hier zur Vorbereitung eine Übersicht über die Themen an, über die Sie sprechen möchten.

source: Add comment
de_de: Kommentar hinzufügen

source: Discussion points
de_de: Diskussionspunkte

source: Create some pointers to kick-start your check-in conversation.
de_de: Erstelle einige Anhaltspunkte, um deinen Dialog zu starten.

source: Edit check-in
de_de: Check-in bearbeiten

source: Edit discussion point
de_de: Diskussionspunkt bearbeiten

source: Back to upcoming
de_de: Zurück zu den bevorstehenden

source: No check-ins have occurred that day.
de_de: An diesem Tag haben keine Check-ins stattgefunden.

source: No upcoming check-ins to be displayed. <br/>Schedule a new check-in.
de_de: Keine bevorstehenden Check-ins anzuzeigen. <br/>Planen Sie ein neues Check-in.

source: No check-ins were recently updated.
de_de: Es wurden keine Check-ins kürzlich aktualisiert.

source: No check-ins have taken place in the past.
de_de: In der Vergangenheit haben keine Check-ins stattgefunden.

source: Each worker to whom this check-in has been assigned can edit this section in their form.
de_de: Alle Mitarbeiter:innen, denen dieser Check-in zugewiesen wurde, können diesen Abschnitt in ihrem Formular bearbeiten.

source: Here are some helpful tips for understanding the different types of check-ins.
de_de: Hier sind einige hilfreiche Tipps, um die verschiedenen Check-in-Typen zu verstehen.

source: About check-ins
de_de: Über Check-in

source: Occurs every two weeks on {{day}} effective {{startOn}} until {{endOn}}. In total, {{count}} number of check-ins will be created.
de_de: Findet alle zwei Wochen am {{day}} statt, beginnend am {{startOn}} bis zum {{endOn}}. Insgesamt werden {{count}} Check-ins erstellt.

source: Goal due date
de_de: Zieldatum

source: Showing goals and deliverables of:
de_de: Zeigt Ziele und Ergebnisse von:

source: Goal priority
de_de: Zielpriorität

source: Goal progress
de_de: Zielfortschritt

source: Goal tracking status
de_de: Zielverfolgungsstatus

source: Goal type: “{{typeName}}“
de_de: Zieltyp: „{{typeName}}“

source: Still in progress.
de_de: Noch in Bearbeitung.

source: How was your check-in?
de_de: Wie war Ihr Check-in?

source: Are you sure you want to mark the check-in <strong>{{checkInTitle}}</strong> as completed?
de_de: Sind Sie sicher, dass Sie das Check-in <strong>{{checkInTitle}}</strong> als abgeschlossen markieren möchten?

source: Marked as done by {{nickName}} {{name}}.
de_de: Als erledigt markiert von {{nickName}} {{name}}.

source: Assigned to
de_de: Zugewiesen an

source: {{count}} workers
de_de: {{count}} Mitarbeiter:innen

source: {{count}} worker
de_de: {{count}} Mitarbeiter:in

source: {{count}} users
de_de: {{count}} Benutzer:innen

source: Number of check-ins assigned to each selected worker and their line manager.
de_de: Anzahl der Check-ins, die jeder/m ausgewählten Mitarbeiter:innen und deren direkten Vorgesetzten zugewiesen sind.

source: Assigned to: {{count}}
de_de: Zugewiesen an: {{count}}

source: This assignment will create {{count}} check-ins between each worker and their line manager. Once the check-in is assigned, users will be able to edit its details and add a date.
de_de: Diese Aufgabe wird {{count}} Check-ins zwischen jeder/m Mitarbeiter:in und deren direkten Vorgesetzten erstellen. Sobald ein Check-in zugewiesen ist, können die Benutzer:innen die Details bearbeiten und ein Datum hinzufügen.

source: Get started by assigning one.
de_de: Beginnen Sie, indem Sie eine zuweisen.

source: No check-ins mass assignments yet!
de_de: Noch keine Massen-Zuweisungen von Check-ins!

source: Excluded individuals
de_de: Ausgeschlossene Personen

source: Excluded workers: {{count}}
de_de: Ausgeschlossene Mitarbeiter:innen: {{count}}

source: Excluded
de_de: Ausgeschlossen

source: Included
de_de: Einbezogen

source: No results match the search criteria. Clear the search to show all results.
de_de: Keine Ergebnisse für die Suchkriterien. Löschen Sie die Suche, um alle Ergebnisse anzuzeigen.

source: Search for workers
de_de: Nach Mitarbeiter:innen suchen

source: Performance check-ins require managers to provide their views on their team members' progress and performance.
de_de: Leistungs-Check-ins erfordern, dass Führungskräfte ihre Ansichten über den Fortschritt und die Leistung ihrer Teammitglieder mitteilen.

source: Regular check-ins enable managers and their team members to discuss day-to-day progress and any developmental focus.
de_de: Regelmäßige Check-ins ermöglichen es Führungskräften und ihren Teammitgliedern, den täglichen Fortschritt und jeden Entwicklungsschwerpunkt zu besprechen.

source: See all participants
de_de: Alle Teilnehmende anzeigen

source: Monthly check-in
de_de: Monatlicher Check-in

source: Search for a worker or an organization
de_de: Nach Mitarbeiter:in oder Organisation suchen

source: Occurs on day {{day}} of every month, effective {{startOn}} through {{endOn}}. In total, {{count}} check-ins will be created.
de_de: Findet am Tag {{day}} jedes Monats statt, gültig von {{startOn}} bis {{endOn}}. Insgesamt werden {{count}} Check-ins erstellt.

source: Specific date
de_de: Bestimmtes Datum

source: Past
de_de: Bisherige

source: Upcoming
de_de: Bevorstehend

source: Today
de_de: Heute

source: Assign check-ins
de_de: Check-ins zuweisen

source: If you're assigning to multiple users, it might take a while for this list to appear in the check-in view.
de_de: Wenn Sie mehreren Benutzer:innen zuweisen, kann es eine Weile dauern, bis diese Liste in der Check-in-Ansicht erscheint.

source: The check-in was successfully assigned.
de_de: Check-in wurde erfolgreich zugewiesen.

source: This assignment will create {{count}} check-ins in total, between each selected worker and their line manager.
de_de: Diese Aufgabe wird insgesamt {{count}} Check-ins zwischen jeder/m ausgewählten Mitarbeiter:in und deren Vorgesetzten erstellen.

source: Are you sure you want to assign this check-in?
de_de: Sind Sie sicher, dass Sie dieses Check-in zuweisen möchten?

source: No description added
de_de: Keine Beschreibung hinzugefügt

source: No discussion points added
de_de: Keine Diskussionspunkte hinzugefügt

source: Overall performance
de_de: Gesamtleistung

source: My overall performance
de_de: Meine Gesamtleistung

source: Offer your team member insight into how you think they have progressed on their overall performance over this period.
de_de: Bieten Sie Ihrem Teammitglied einen Einblick, wie es Ihrer Meinung nach in diesem Zeitraum seine Gesamtleistung verbessert hat.

source: Check-in with
de_de: Check-in mit

source: Pending manager submission
de_de: Ausstehende Einreichung der Führungskraft

source: Allow managers to schedule dedicated conversations with direct reports to address performance-related topics.
de_de: Dieses Check-in erfordert, dass eine Führungskraft ihre Sichtweise darauf mitteilt, wie sich das Teammitglied im Laufe des Zeitraums entwickelt hat. Sobald die Führungskraft das Check-in eingereicht hat, kann das Teammitglied die Sichtweise der Führungskraft auf seine Leistung sehen und entweder das Check-in akzeptieren und abschließen oder sich für ein weiteres Gespräch entscheiden.

source: Offer your team member insights into how you think they have progressed on their behaviors this period.
de_de: Bieten Sie Ihrem Teammitglied Einblicke in die Fortschritte, die es Ihrer Meinung nach in diesem Zeitraum bei seinem Verhalten gemacht hat.

source: Your comment
de_de: Ihr Kommentar

source: Please share your thoughts in this section.
de_de: Bitte teilen Sie Ihre Gedanken in diesem Abschnitt mit.

source: Gain insight into how your manager thinks you are progressing on your behaviors over this period.
de_de: Erhalten Sie Einblick, wie Ihre Führungskraft Ihre Fortschritte bei Ihrem Verhalten in diesem Zeitraum einschätzt.

source: Gain insight into how your manager thinks you are progressing on your goals over this period.
de_de: Erhalten Sie Einblicke in die Einschätzung Ihrer Führungskraft, wie Sie in diesem Zeitraum beim Erreichen Ihrer Ziele vorankommen.

source: Gain insight into how your manager thinks you are progressing on your overall performance over this period.
de_de: Erhalten Sie Einblick, wie Ihre Führungskraft Ihre Fortschritte bei der Gesamtleistung in diesem Zeitraum einschätzt.

source: Offer your team member insights into how you think they have progressed on their goals over this period.
de_de: Bieten Sie Ihrem Teammitglied Einblicke in die Fortschritte, die es Ihrer Meinung nach in diesem Zeitraum bei seinen Zielen gemacht hat.

source: This gives you insights into how your manager thinks you are progressing on your behaviors over this period.
de_de: Dies gibt Ihnen Einblicke in die Einschätzung Ihrer Führungskraft, welche Verhaltensfortschritte Sie in diesem Zeitraum erzielt haben.

source: Offer your team member insights into how you think they have progressed on their overall performance over this period.
de_de: Bieten Sie Ihrem Teammitglied Einblicke, wie es sich Ihrer Meinung nach in seiner Gesamtleistung in diesem Zeitraum entwickelt hat.

source: Select rating
de_de: Bewertung auswählen

source: This user is inactive or your reporting relationship with them has changed. You can't create or update check-ins with them.
de_de: Diese:r Benutzer:in ist inaktiv oder Ihre Berichtsbeziehung hat sich geändert. Sie können keine Check-ins mit ihm/ihr erstellen oder aktualisieren.

source: The end date must be later than the start date.
de_de: Das Enddatum muss nach dem Startdatum liegen.

source: Bi-weekly
de_de: Zweiwöchentlich

source: Monthly
de_de: Monatlich

source: Weekly
de_de: Wöchentlich

source: Repeat
de_de: Wiederholen

source: Recurrence details
de_de: Wiederholungsdetails
